export default {
    welcome: "Καλώς ήρθατε",
    home: "Αρχική",
    about: "Σχετικά",

    lang: "ελληνικά",
    validationMessages: {
        required: "Το πεδίο είναι υποχρεωτικό",
        email: "Παρακαλώ εισάγετε μια έγκυρη διεύθυνση email",
        numeric: "Παρακαλώ εισάγετε μια αριθμητική τιμή",
        alpha: "Παρακαλώ εισάγετε μόνο αλφαβητικούς χαρακτήρες",
        alphaNumeric: "Παρακαλώ εισάγετε μόνο αλφαριθμητικούς χαρακτήρες",
        date: "Παρακαλώ εισάγετε μια έγκυρη ημερομηνία",
        minLength: "Το ελάχιστο μήκος είναι {min} χαρακτήρες",
        maxLength: "Το μέγιστο μήκος είναι {max} χαρακτήρες",
        minValue: "Η ελάχιστη τιμή είναι {min}",
        maxValue: "Η μέγιστη τιμή είναι {max}",
        confirmPassword: "Οι κωδικοί δεν ταιριάζουν",
        invalidFormat: "Μη έγκυρη μορφή",
        valueRequired: "Το πεδίο είναι υποχρεωτικό όταν το σχετικό πεδίο έχει τιμή",
    },
};
